# -*- coding: utf-8 -*-
"""Task 3.1.ipynb

Automatically generated by Colaboratory.

Original file is located at
    https://colab.research.google.com/drive/1mbVyj-yoV6Yi5YXOQGmIv7VTJzqEqkoU

a) Написать программу, которая удаляет из списка все элементы, стоящие на четных позициях.
"""

def remove_even_positions(lst):
    return [lst[i] for i in range(len(lst)) if i % 2 == 0]

# Пример использования
my_list = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
result = remove_even_positions(my_list)

print(result)

"""b) Написать программу, которая считывает список слов и находит слова, содержащие более трех гласных букв."""

def find_words_with_more_vowels(words):
    vowels = ['a', 'e', 'i', 'o', 'u']
    result = []
    for word in words:
        vowel_count = sum(1 for char in word if char.lower() in vowels)
        if vowel_count > 3:
            result.append(word)
    return result

# Пример использования
word_list = ['hello', 'python', 'programming', 'education', 'elephant']
result = find_words_with_more_vowels(word_list)

print(result)

"""c) Написать программу, которая находит второй по величине элемент в списке."""

def find_second_largest(lst):
    if len(lst) < 2:
        return None
    largest = second_largest = float('-inf')
    for num in lst:
        if num > largest:
            second_largest = largest
            largest = num
        elif largest > num > second_largest:
            second_largest = num
    return second_largest

# Пример использования
my_list = [9, 5, 3, 7, 9, 2, 1]
result = find_second_largest(my_list)

print(result)

"""d) Написать программу, которая удаляет из списка все дубликаты."""

def remove_duplicates(lst):
    return list(set(lst))

# Пример использования
my_list = [1, 2, 3, 2, 4, 5, 1, 3]
result = remove_duplicates(my_list)

print(result)

"""e) Написать программу, которая считывает данные из CSV-файла и создает словарь, где ключами являются значения в столбце «Name», а значениями — соответствующие им словари с информацией о поле, возрасте и зарплате."""

import csv

# Открываем CSV-файл
with open('/content/drive/MyDrive/Task 3.1.csv', 'r', encoding='utf-8', newline='') as file:
    # Создаем объект DictReader для чтения данных из файла
    reader = csv.DictReader(file, delimiter=';')  # или другой символ разделителя

    # Создаем пустой словарь
    dictionary = {}

    # Проходимся по каждой строке CSV-файла
    for row in reader:
        # Получаем значения столбцов из текущей строки
        name = row['Name']
        gender = row['Gender']
        age = int(row['Age'])
        salary = int(row['Salary'])

        # Создаем словарь с информацией о поле, возрасте и зарплате
        info = {gender, age, salary}

        # Проверяем, есть ли уже такой ключ (имя) в словаре
        if name in dictionary:
            # Если есть, добавляем информацию в список значений для этого ключа
            dictionary[name].append(info)
        else:
            # Если ключа (имени) еще нет в словаре, создаем список со значением
            dictionary[name] = [info]

# Выводим получившийся словарь
print(dictionary)

"""f) Написать программу, которая запрашивает у пользователя строку и выводит на экран все ее подстроки длиной не менее трех символов."""

def print_substrings(string):
    n = len(string)
    for i in range(n):
        for j in range(i + 3, n + 1):
            print(string[i:j])

# Пример использования
user_input = input("Введите строку: ")
print_substrings(user_input)